Revit 2027 API
RebarBendingDetail.GetPosition Method
 Gets the position of the bending detail relative to its view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static XYZ GetPosition(
	Element bendingDetail
)
Public Shared Function GetPosition (
	bendingDetail As Element
) As XYZ
public:
static XYZ^ GetPosition(
	Element^ bendingDetail
)
static member GetPosition :
        bendingDetail : Element -> XYZ
Parameters
bendingDetail Element
 The bending detail for which we want to get the position.
Return Value
XYZ
 Returns the position of the bending detail relative to its view.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace